[ { "category" : "Web Applications",
    "comments" : "After college, I was working in a molecular biology lab performing research in the field of cell polarity. I found that I wasn't the most talented of researchers, however I did have a knack for finding solutions to several problems. By most standards, this is a simple CRUD application with a web frontend. I had made a few personal websites in college, but this was the first application that was utilized by other people. The PI was immensely proud of it, and it impressed several PIs all over the world in that they could readily see what constructs we had available for them to request, and any special caveats that we had found during use. The lab manager and I enjoyed it because it turned searching for lot and item numbers trivial when a researcher needed us to find a replacement of a construct or antibody. Unfortunately, the professor has since moved away, and I think the site is gone.",
    "description" : "A lab inventory system that also contained several tools to track supply ordering, and to provide automation to typical tasks that the researchers performed.",
    "highlights" : [ "Utilized PHP4 for the initial release. Used a MySQL 4.0 backend.",
            "Hosted on a small PowerPC computer that ran Yellowdog Linux.",
            "Later ported to Classic ASP with an Access backend in order to run on university servers.",
            "Used several simple array manipulations to create siRNA sequences.",
            "Was a great sandbox for learning the lighter forms of web security (SQL injection, Cross Site Requests).",
            "Validated to HTML 4.0 Strict and CSS 2.0"
          ],
    "id" : "1",
    "screenshots" : [ "MacInv1.PNG",
            "MacInv2.PNG",
            "MacInv3.PNG"
          ],
    "tags" : [ "PHP",
            "MySQL",
            "ASP",
            "MS Access",
            "Linux"
          ],
    "title" : "Lab Inventory System"
  },
  { "category" : "Desktop Applications",
    "comments" : "This was a project where I was the principle designer and developer, so it began as a solo project within the company. It is currently team-owned for maintenance. It has been utilized in all of our major BI undertakings at the company, and is also utilized at some of our client companies to great effect.",
    "description" : "The editor provides a mechanism of documenting all aspects of a BI solution, be it tables, fields, procedures, functions, reports, dashboards, etc. This editor has the ability to pull in RDBMS and SSAS schemas and provides a user interface for documentation and hierarchical linking.",
    "highlights" : [ "Pluggable interface allowing for an easier development new import and export plugins.",
            "Saves metadata to an XML file for easy parsing.",
            "Has a companion web viewer that allows deployment of the documentation to a client site."
          ],
    "id" : "2",
    "screenshots" : " \n      ",
    "tags" : [ "MS SQL Server",
            "SSAS",
            "Winforms",
            "XML",
            "WIX",
            "CruiseControl.NET",
            "Subversion"
          ],
    "title" : "Metadata Editor"
  },
  { "category" : "Web Applications",
    "comments" : "IssueTracker has gone through several iterations that have increased functionality and performance of the platform. There are currently two helper applications that utilize the SDK, one is an outlook plugin that helps track emails and the other is a screenshot program for easy creation of issues while testing.",
    "description" : "IssueTracker allows employees to manage and follow various projects and issues. It also functions as a time tracking system from which clients are invoiced.",
    "highlights" : [ "I performed the initial port from Webforms to MVC. This was done for mainenance and performance purposes.",
            "The original port utilized RPC services using WCF. It was recently changed to use RESTful MVC services.",
            "I designed and implemented an SDK to help with easily creating integrated applications."
          ],
    "id" : "3",
    "screenshots" : [ "issuetracker1.PNG",
            "issuetracker2.PNG",
            "issuetracker3.PNG"
          ],
    "tags" : [ "ASP.NET",
            "MVC",
            "Entity Framework",
            "MS SQL Server",
            "RESTful Services",
            "WCF",
            "jQuery",
            "MS Office",
            "Outlook",
            "SOA",
            "CruiseControl.NET",
            "Subversion"
          ],
    "title" : "IssueTracker"
  },
  { "category" : "Desktop Applications",
    "comments" : "This program was based on an open source program called btnet. The UI was drastically changed, and parts of the program were tweaked to integrate more closely with IssueTracker and improve performance.",
    "description" : "The screen capture program integrates with the issue tracker system to allow testers and users to eaily upload bugs as they occur. The program works in a similar manner to the Snipping Tool, in that a user can do a full screen grab, a single window grab, or a selection. Screenshots may then be turned into issues or attached to existing issues directly.",
    "highlights" : ["Uses the IssueTracker SDK."],
    "id" : "4",
    "screenshots" : "",
    "tags" :  [ "Winforms",
            "RESTful Services",
            "WIX",
            "CruiseControl.NET",
            "Subversion"
          ],
    "title" : "IssueTracker Screen Capture"
  },
  { "category" : "Desktop Applications",
    "comments" : "This project was an intense one. It was performed in a team setting with me coding the service tiers and the invoicing engine, and another developer doing the UI work. We also employed an offsite testing team to check our nightly builds and log issues. Most of the technical architecture for the engine and services was left to me. I heavily leaned on a test-driven approach to ensure accuracy in the invoice calculations. I still remember during our first alpha release when the client ran the invoices. They were astounded that the number returned was more accurate than their current system.",
    "description" : "The Invoice Automation program was designed and implemented for a medium-sized healthcare company. It is designed to be flexible enough to handle most of their complicated contracts with their clients. It provides a mechanism for configuration of contracts and clients, and an engine that calculates monthly invoices for addition to the GL.",
    "highlights" : [ "Replaced an inflexible system with a highly configurable and extensible system.",
            "Has cut the invoicing process for the client from days to hours.",
            "Employs a multithreaded design for performance.",
            "Engine will automatically scale to the hardware on which it is installed.",
            "Interface-driven design is utilized to increase flexibility and maintainability of the product."
          ],
    "id" : "5",
    "screenshots" : "",
    "tags" : [ "Winforms",
            "WCF",
            "Linq to SQL",
            "MS SQL Server",
            "SOA",
            "Unit Tests",
            "WIX",
            "CruiseControl.NET",
            "TFS",
            "Subversion"
          ],
    "title" : "Invoice Automation"
  },
  { "category" : "Web Applications",
    "comments" : "Before GATE was created, the company in question had been using different scheduling products that had all fallen short in some way. Most of them did not alert the users if a job failed to run. GATE was born as a way to have a distributed, reliable scheduling mechanism. This was a fun project to design and develop, as it was my first foray into multithreading and distributed applications. I learned many lessons about race conditions, and robust error recovery while working on this project.",
    "description" : "GATE is a multithreaded scheduler that monitors and runs all ETL and Reporting needs within a company.",
    "highlights" : [ "Pluggable design for different worker types (Command Line, SQL Command, Eligibility Process, etc.).",
            "Service can be installed on multiple servers for horizontal scaling.",
            "Each instance had a configurable number of concurrent workers.",
            "Web frontend for configuration of services.",
            "Featured a complete logging backend with error parsing to determine if a job or task completed successfully",
            "Allowed for custom notifications on a per-job basis."
          ],
    "id" : "6",
    "screenshots" : "",
    "tags" : [ "ASP.NET",
            "Webforms",
            "Windows Service",
            ".NET Remoting",
            "MS SQL Server",
            "Subversion"
    ],
    "title" : "GATE"
  },
  { "category" : "Utilities",
    "comments" : "XForm was a project that was given to me when the lead developer of my employer went on vacation. To me it was an interesting challenge, despite the fact that everything it does can be done just as well with SSIS. The catch was that my employer did not have a license for BIDS, and the DBA was fiercely against using SSIS packages. Hence, XForm was coded in about three days. It was my first foray into using a form of the abstract factory pattern, and utilizing interfaces for the bulk of the design. I also remember this fondly, because it was the first project where I began to mentor a junior developer (He is now a lead at another company).",
    "description" : "XForm was a program that was created to process any format of input data into any format of output data with a little bit of configuration thrown in.",
    "highlights" : [ "Featured an interface-based design approach that allowed for pluggable input and output handlers",
            "Was able to process many forms of flat files including Access databases, Excel spreadsheets, delimited files and fixed width files.",
            "Was a high performance step to eligibility file processing."
          ],
    "id" : "7",
    "screenshots" : "",
    "tags" : [ "Windows Console",
            "MS SQL Server",
            "Subversion"
          ],
    "title" : "XForm"
  },
  { "category" : "Web Applications",
    "comments" : "This was one product in which I was intensely proud to have taken part. I was the senior developer in a team of devs that worked on a new way to process HRAs for our company. The editor in particular was my main responsiblity, but I had a large hand in the scripting of the player, also. This is one product that I wish I could show screenshots, because it ranks at one of the most interesting things that I have worked on in my entire career.",
    "description" : "Flywheel was the codename for an ambitious editor and player for the creation and administration of HRAs (Health Risk Assessments). It is currently in production with a large health insurance company.",
    "highlights" : [ "Featured a fully functional web editor that worked like a word processor for creating assessments.",
            "Highly performant as compared to previous HRA engines.",
            "Allowed for complicated branching of questions based on previous answers.",
            "The HRA editor featured its own scripting language for branching logic, which was parsed at runtime by the player."
          ],
    "id" : "8",
    "screenshots" : "",
    "tags" : [ "ASP.NET",
            "jQuery",
            "MS SQL Server",
            "TeamCity",
            "Subversion"
          ],
    "title" : "\"Flywheel\""
  },
  { "category" : "Utilities",
    "comments" : "This is one of those tools that I was a little incredulous about writing, but now it is almost indispensible to my workflow. It also turned out to be much easier than I initially thought it would be.",
    "description" : "This plugin integrates directly into Outlook 2010 to allow for quick creation and tracking of email chains within IssueTracker.",
    "highlights" : [ "Allows, at the click of a button, an easy way to attach an email to an existing ticket, or create a new ticket in IssueTracker",
            "Monitors the email thread, and adds each successive reply to the relevant issue.",
            "Catches all attachments, and adds them to the relevant issue."
          ],
    "id" : "9",
    "screenshots" : "",
    "tags" : [ "Microsoft Office",
            "RESTful Services",
            "Winforms",
            "CruiseControl.NET",
            "Subversion"
          ],
    "title" : "IssueTracker Outlook Plugin"
  },
  { "category" : "Administration",
    "comments" : "Automation via a build server was something that I eventually came to terms with at one of my previous employers. I often say that build automation becomes an integral part of a programmer's life once they learn the ins and outs of what can be done, much like source control. When you go somewhere that doesn't have it, you feel like you are missing something really necessary.",
    "description" : "I have been involved in the automation of builds for several projects within my places of employment, and with clients.",
    "highlights" : [ "I am the main build master for my current employer, and am the build master for an external client.",
            "I have developed scripts to automate the build and packaging of many client projects.",
            "I have assisted clients with setting up their own automated build/packaging systems."
          ],
    "id" : "10",
    "screenshots" : "",
    "tags" : [ "CruiseControl.NET",
            "TFS",
            "TeamCity"
          ],
    "title" : "Build Automation"
  },
  { "category" : "Web Applications",
    "comments" : "There isn't much to say about this project. It was our company's bread and butter for our clients. It was also a very high profile application that took some care when augmenting and fixing.",
    "description" : "iCoach4You is a wellness portal developed for use by a large health insurance company, and other wellness providers across the country. It is a primary means for connecting to personal health coaching and healthy lifestyle information.",
    "highlights" : [ "Served as lead developer for this large team project.",
            "Site serviced many companies across the country.",
            "Site features a complex workflow engine to determine client status.",
            "Site integrated the \"Flywheel\" project for HRA administration."
          ],
    "id" : "11",
    "links" : [{ "caption" : "iCoach4You Portal (requires sponsored registration)",
            "url" : "http://icoach4you.com"
          }],
    "screenshots" : "",
    "tags" : [ "ASP.NET",
            "Webforms",
            "jQuery",
            "MS SQL Server",
            "TeamCity",
            "Subversion",
            "Visual SourceSafe"
          ],
    "title" : "iCoach4You"
  },
  { "category" : "Administration",
    "comments" : "\n        I am one of those developers that unabashedly loves source control. I like what can be accomplished when it is utilized correctly, and I like the sense of security it can bring to a project.\n      ",
    "description" : "Source control is something that people love or hate. I have my opinions on what that means, but, regardless, SCM is necessary for any non-trivial project to succeed in a team environment.",
    "highlights" : [ "I was the administrator of my employer's subversion repository.",
            "I was one of the administrators for the TFS repository for an external client."
          ],
    "id" : "12",
    "screenshots" : "",
    "tags" : [ "Visual SourceSafe",
            "Subversion",
            "TFS"
          ],
    "title" : "Source Control"
  },
  { "category" : "Personal Projects",
    "comments" : "This personal site is more of my playground than anything. If I want to learn a new scripting technique, it is usually done here. It has been through several iterations, and will probably continue to be reworked as I keep my curiosity.",
    "description" : "This is my portfolio site.",
    "highlights" : [ "Persistence layer is a JSON document containing formatted project information.",
            "Site processing is done entirely in javascript. There is no server code running.",
            "Single page application with responsive design."
          ],
    "id" : "13",
    "links" : [{ "caption" : "This site (where you are already)",
            "url" : "http://mycodinglife.com"
          }],
    "screenshots" : "",
    "tags" : [ "MVVM",
            "jQuery",
            "Git",
            "XML",
            "Durandal",
            "Knockout",
            "AngularJS",
            "Gulp",
            "NodeJs",
            "Bootstrap"
          ],
    "title" : "mycodinglife"
  },
  { "category" : "Web Applications",
      "comments" : "This application is a playground that I use to learn some basics about Java programming, RESTful Services, and JUnit testing. It is very simple, and is getting new commits from time to time as I want to try out new approaches and techniques.",
      "description" : "A test application written in Java as a way to learn accepted standards and gotchas. Will eventually have the functionality of the Lab Inventory System.",
      "id" : "15",
      "tags" : [ "Java",
          "JUnit",
          "GSon",
          "RESTful Services",
          "AngularJS",
          "Bootstrap",
          "Javascript"],
      "title" : "Inventory"
  }]